/**
 * 胡桃  基礎数値
 * HP, ATK, DEFは、Lvと突破状態の順で格納。
 * 1/20 = 0, 20/20 = 1, ... 90/90 = 13
 */

export const Hutao = {
  name: "胡桃",
  star: 5,
  element: "Pyro",
  weaponType: "Polearm",
  specialStatusType: "criticalDamage",
  HP: [1211, 3141, 4179, 6253, 6990, 8042, 9026, 10089, 10826, 11899, 12637, 13721, 14459, 15552],
  ATK: [8, 21, 29, 43, 48, 55, 62, 69, 74, 81, 86, 94, 99, 106],
  DEF: [68, 177, 235, 352, 394, 453, 508, 568, 610, 670, 712, 773, 815, 876],
  specialStatus: [0, 0, 0, 0, 9.6, 9.6, 19.2, 19.2, 19.2, 19.2, 28.8, 28.8, 38.4, 38.4]
};
