/**
 * 元素反応固定ダメージ基礎数値
 */
//過負荷
const OverloadBaseDamage = {
  1: 34,
  20: 161,
  40: 415,
  50: 647,
  60: 979,
  70: 1533,
  80: 2159,
  90: 2901
};

//感電
const ElectroChargeBaseDamage = {
  1: 21,
  20: 97,
  40: 249,
  50: 388,
  60: 587,
  70: 920,
  80: 1295,
  90: 1741
};

//拡散
const SwirlBaseDamage = {
  1: 10,
  20: 48,
  40: 124,
  50: 194,
  60: 294,
  70: 460,
  80: 648,
  90: 868
};

//氷砕き
const ShatterBaseDamage = {
  1: 26,
  20: 121,
  40: 311,
  50: 485,
  60: 734,
  70: 1150,
  80: 1619,
  90: 2176
};
